cf/ExchangePlans/ExchangeSmallBusinessAccounting20.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ExchangeSmallBusinessAccounting20</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentsDumpStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseCompaniesFilter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TaxTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DebitItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCash</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PettyCashes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportModeOnDemand</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectsExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegisterChanges</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManualExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseDocumentTypesFilter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ImportDocumentsFromEnterprisesAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SynchronizationModeData</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectsExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Companies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DocumentKinds</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObjectName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

cf/Enums/ExchangeObjectsExportModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ExchangeObjectsExportModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AlwaysExport</Name>
					<Comment>Export without of applying filters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportByCondition</Name>
					<Comment>Export with filters applying</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportIfNecessary</Name>
					<Comment>Export without of applying filters, but with referential integrity control of exporting data</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportManually</Name>
					<Comment>In this modes changes are not registered automatically (through event subscriptions); objects are registering for export manually by user and export only if match to filter, set at the node, for which export is performing</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DoNotExport</Name>
					<Comment>In this modes changes are not registered automatically (through event subscriptions) and not exporting, even if changes of objects were registered manually by user.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/ExchangePlans/ExchangeSmallBusinessAccounting20/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	If IsNew() Then
		
		If Not UseCompaniesFilter AND Companies.Count() <> 0 Then
			Companies.Clear();
		ElsIf Companies.Count() = 0 AND UseCompaniesFilter Then
			UseCompaniesFilter = False;
		EndIf;
		
		If Not UseDocumentTypesFilter AND DocumentKinds.Count() <> 0 Then
			DocumentKinds.Clear();
		ElsIf DocumentKinds.Count() = 0 AND UseDocumentTypesFilter Then
			UseDocumentTypesFilter = False;
		EndIf;
		
		If Not ValueIsFilled(ExportModeOnDemand) Then
			ExportModeOnDemand = Enums.ExchangeObjectsExportModes.ExportIfNecessary;
		EndIf;
		
		If ManualExchange Then
			SynchronizationModeData = Enums.ExchangeObjectsExportModes.ExportManually;
		Else
			SynchronizationModeData = Enums.ExchangeObjectsExportModes.AlwaysExport;
		EndIf;
		
	EndIf;
	
EndProcedure

#EndIf
